fix: update readme with mermaid graphics
